# 1.2 Выборка данных

---

## Инициализация БД

In [1]:
%load_ext sql
import sqlalchemy
engine = sqlalchemy.create_engine('mysql://user:pass@localhost:3306/stepik')
%sql mysql://user:pass@localhost:3306/stepik

'Connected: user@stepik'

## Заполнение таблицы из CSV файла

In [31]:
# Чтение файла в DataFrame
import pandas as pd
file = 'tables/book.csv'
df = pd.read_csv(file)
df

   book_id                  title            author   price  amount
0        1     Мастер и Маргарита     Булгаков М.А.  670.99       3
1        2          Белая гвардия     Булгаков М.А.  540.50       5
2        3                  Идиот  Достоевский Ф.М.  460.00      10
3        4      Братья Карамазовы  Достоевский Ф.М.  799.01       2
4        5  Стихотворения и поэмы       Есенин С.А.  650.00      15

Создание схемы таблицы:

In [37]:
%%sql

  DROP TABLE IF EXISTS book;
CREATE TABLE IF NOT EXISTS book (
       book_id INT PRIMARY KEY AUTO_INCREMENT,
       title   VARCHAR(50),
       author  VARCHAR(30),
       price   DECIMAL(8, 2), #
       amount  INT
);

 * mysql://user:***@localhost:3306/stepik
0 rows affected.
0 rows affected.

[]

In [38]:
# Запись данных в таблицу из DataFrame
types = {
    'book_id': sqlalchemy.Integer(),
    'price'  : sqlalchemy.Numeric(precision=8, scale=2),
    'amount' : sqlalchemy.Integer()
}
df.to_sql('book', con=engine, index=False, if_exists='append', dtype=types, method='multi')

***

# Упражнения

### Выборка всех данных из таблицы

In [42]:
%%sql
SELECT * 
  FROM book;

 * mysql://user:***@localhost:3306/stepik
5 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

### Выборка отдельных столбцов

In [47]:
%%sql
SELECT author, title, price 
  FROM book;

 * mysql://user:***@localhost:3306/stepik
5 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('670.99')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.50')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('650.00'))]

### Выборка новых столбцов и присвоение им псевдонимов

In [46]:
%%sql
SELECT title  AS Название,
       author AS Автор 
  FROM book;

 * mysql://user:***@localhost:3306/stepik
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.'),
 ('Белая гвардия', 'Булгаков М.А.'),
 ('Идиот', 'Достоевский Ф.М.'),
 ('Братья Карамазовы', 'Достоевский Ф.М.'),
 ('Стихотворения и поэмы', 'Есенин С.А.')]

### Выборка данных с созданием вычисляемого столбца

In [49]:
%%sql
SELECT title, amount, 
       amount * 1.65 AS pack        
  FROM book;

 * mysql://user:***@localhost:3306/stepik
5 rows affected.

[('Мастер и Маргарита', 3, Decimal('4.95')),
 ('Белая гвардия', 5, Decimal('8.25')),
 ('Идиот', 10, Decimal('16.50')),
 ('Братья Карамазовы', 2, Decimal('3.30')),
 ('Стихотворения и поэмы', 15, Decimal('24.75'))]

### Выборка данных, вычисляемые столбцы, математические функции

В SQL реализовано множество  [математических функций](https://docs.microsoft.com/ru-ru/sql/t-sql/functions/mathematical-functions-transact-sql?view=sql-server-ver15) для работы с числовыми данными. В таблице приведены некоторые из них.

| Функция | Описание | Пример |
|---|---|---|
| `CEILING(x)` | Возвращает наименьшее целое число, большее или равное X<BR>(округляет до целого числа в большую сторону) | `CEILING(4.2)=5<br>CEILING(-5.8)=-5` |
| `ROUND(x, k)` | Округляет значение X до K знаков после запятой,<BR>если K не указано – X округляется до целого | `ROUND(4.361)=4<br>ROUND(5.86592,1)=5.9` |
| `FLOOR(x)` | Возвращает наибольшее целое число, меньшее или равное X<BR>(округляет до  целого числа в меньшую сторону) | `FLOOR(4.2)=4<br>FLOOR(-5.8)=-6` |
| `POWER(x, y)` | Возведение X в степень Y | `POWER(3,4)=81.0` |
| `SQRT(x)` | Квадратный корень из X | `SQRT(4)=2.0<br>SQRT(2)=1.41...` |
| `DEGREES(x)` | Конвертирует значение X из радиан в градусы | `DEGREES(3) = 171.8...` |
| `RADIANS(x)` | Конвертирует значение X из градусов в радианы | `RADIANS(180)=3.14...` |
| `ABS(x)` | Модуль числа X | `ABS(-1) = 1<br>ABS(1) = 1` |
| `PI()` | PI = 3.1415926... |  |

__Пример__  
Для каждой книги из таблицы book вычислим НДС (имя столбца tax) , который включен в цену и составляет k = 18%,  а также цену книги (price_tax) без него.  
Формула ниже отвечает на вопрос _"Какую сумму увеличили на 18%, чтобы получить текущее значение"_

In [55]:
%%sql
-- Вычисление НДС
SELECT title, price, 
       ROUND((price*18/100)/(1+18/100),2) AS tax, 
       ROUND(price/(1+18/100),2) AS price_tax 
  FROM book;

 * mysql://user:***@localhost:3306/stepik
5 rows affected.

[('Мастер и Маргарита', Decimal('670.99'), Decimal('102.35'), Decimal('568.64')),
 ('Белая гвардия', Decimal('540.50'), Decimal('82.45'), Decimal('458.05')),
 ('Идиот', Decimal('460.00'), Decimal('70.17'), Decimal('389.83')),
 ('Братья Карамазовы', Decimal('799.01'), Decimal('121.88'), Decimal('677.13')),
 ('Стихотворения и поэмы', Decimal('650.00'), Decimal('99.15'), Decimal('550.85'))]

__Задание__  
В конце года цену всех книг на складе пересчитывают – снижают ее на 30%.  
Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг.  
Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.

In [56]:
%%sql
SELECT title, author, amount,
       ROUND(price * 0.7, 2) AS new_price
  FROM book;

 * mysql://user:***@localhost:3306/stepik
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', 3, Decimal('469.69')),
 ('Белая гвардия', 'Булгаков М.А.', 5, Decimal('378.35')),
 ('Идиот', 'Достоевский Ф.М.', 10, Decimal('322.00')),
 ('Братья Карамазовы', 'Достоевский Ф.М.', 2, Decimal('559.31')),
 ('Стихотворения и поэмы', 'Есенин С.А.', 15, Decimal('455.00'))]